import Image from 'next/image'
import {array} from "zod";

var Areas = [
    {
        "name": "رستم آباد- فرمانیه"
    },
    {
        "name": "اوین"
    },
    {
        "name": "درکه"
    },
    {
        "name": "زعفرانیه"
    },
    {
        "name": "محمودیه"
    },
    {
        "name": "ولنجک"
    },
    {
        "name": "امام زاده قاسم (ع)"
    },
    {
        "name": "دربند"
    },
    {
        "name": "گلابدره"
    },
    {
        "name": "جماران"
    },
    {
        "name": "دزاشیب"
    },
    {
        "name": "نیاوران"
    },
    {
        "name": "اراج"
    },
    {
        "name": "کاشانک"
    },
    {
        "name": "شهرک دانشگاه"
    },
    {
        "name": "شهرک نفت"
    },
    {
        "name": "دارآباد"
    },
    {
        "name": "باغ فردوس"
    },
    {
        "name": "تجریش"
    },
    {
        "name": "قیطریه"
    },
    {
        "name": "چیذر"
    },
    {
        "name": "حکمت"
    },
    {
        "name": "ازگل"
    },
    {
        "name": "سوهانک"
    },
    {
        "name": "شهید محلاتی"
    },
    {
        "name": "اتوبان امام علی"
    },
    {
        "name": "اتوبان صدر"
    },
    {
        "name": "اقدسیه"
    },
    {
        "name": "الهیه – فرشته"
    },
    {
        "name": "اندرزگو"
    },
    {
        "name": "بلوار ارتش"
    },
    {
        "name": "پارک وی"
    },
    {
        "name": "تجریش"
    },
    {
        "name": "جمشیدیه"
    },
    {
        "name": "دیباجی"
    },
    {
        "name": "سعدآباد"
    },
    {
        "name": "صاحبقرانیه"
    },
    {
        "name": "فرمانیه"
    },
    {
        "name": "قیطریه"
    },
    {
        "name": "محمودیه"
    },
    {
        "name": "مقدس اردبیلی"
    },
    {
        "name": "مینی سیتی"
    },
    {
        "name": "نوبنیاد"
    },
    {
        "name": "ولیعصر"
    },
    {
        "name": "کاشانک"
    },
    {
        "name": "کامرانیه"
    },
    {
        "name": "بوعلی"
    },
    {
        "name": "سعادت آباد"
    },
    {
        "name": "مدیریت"
    },
    {
        "name": "کوهسار"
    },
    {
        "name": "پونک"
    },
    {
        "name": "شهید چوب تراش"
    },
    {
        "name": "شهید خرم رودی"
    },
    {
        "name": "صادقیه شمالی شهرک هما"
    },
    {
        "name": "صادقیه"
    },
    {
        "name": "شهرآرا"
    },
    {
        "name": "کوی نصر"
    },
    {
        "name": "پردیسان"
    },
    {
        "name": "شهرک آزمایش"
    },
    {
        "name": "تهران ویلا"
    },
    {
        "name": "برق آلستوم"
    },
    {
        "name": "تیموری"
    },
    {
        "name": "طرشت"
    },
    {
        "name": "همایونشهر"
    },
    {
        "name": "توحید"
    },
    {
        "name": "زنجان"
    },
    {
        "name": "شادمهر"
    },
    {
        "name": "ایوانک"
    },
    {
        "name": "دریا"
    },
    {
        "name": "شهرک قدس"
    },
    {
        "name": "آسمانها"
    },
    {
        "name": "درختی"
    },
    {
        "name": "فرحزاد"
    },
    {
        "name": "مخابرات"
    },
    {
        "name": "پرواز"
    },
    {
        "name": "آزادی"
    },
    {
        "name": "اتوبان حکیم"
    },
    {
        "name": "اتوبان شیخ فضل اله نوری"
    },
    {
        "name": "اتوبان محمد علی جناح"
    },
    {
        "name": "اتوبان نیایش"
    },
    {
        "name": "اتوبان یادگار امام"
    },
    {
        "name": "بهبودی"
    },
    {
        "name": "جلال آل احمد"
    },
    {
        "name": "خوش شمالی"
    },
    {
        "name": "ستارخان"
    },
    {
        "name": "شادمان"
    },
    {
        "name": "شهرک ژاندارمری"
    },
    {
        "name": "شهرک غرب"
    },
    {
        "name": "گیشا"
    },
    {
        "name": "مترو شریف"
    },
    {
        "name": "مرزداران"
    },
    {
        "name": "آرارات"
    },
    {
        "name": "ونک"
    },
    {
        "name": "امانیه"
    },
    {
        "name": "زرگنده"
    },
    {
        "name": "درب دوم"
    },
    {
        "name": "رستم آباد و اختیاریه"
    },
    {
        "name": "داودیه"
    },
    {
        "name": "سید خندان"
    },
    {
        "name": "دروس"
    },
    {
        "name": "قبا"
    },
    {
        "name": "قلهک"
    },
    {
        "name": "کاوسیه"
    },
    {
        "name": "اختیاریه"
    },
    {
        "name": "پاسداران"
    },
    {
        "name": "جردن"
    },
    {
        "name": "جلفا"
    },
    {
        "name": "خواجه عبداله"
    },
    {
        "name": "دولت ( کلاهدوز )"
    },
    {
        "name": "شیخ بهایی"
    },
    {
        "name": "شیراز"
    },
    {
        "name": "ظفر"
    },
    {
        "name": "ملاصدرا"
    },
    {
        "name": "میدان کتابی"
    },
    {
        "name": "میرداماد"
    },
    {
        "name": "ولیعصر(بین پارک وی ونیایش)"
    },
    {
        "name": "مهران"
    },
    {
        "name": "کاظم آباد"
    },
    {
        "name": "کوهک"
    },
    {
        "name": "مجیدیه و شمس آباد"
    },
    {
        "name": "پاسداران و ضرابخانه"
    },
    {
        "name": "حسین آباد و مبارک آباد"
    },
    {
        "name": "شیان و لویزان"
    },
    {
        "name": "علم و صنعت"
    },
    {
        "name": "نارمک"
    },
    {
        "name": "تهرانپارس غربی"
    },
    {
        "name": "جوادیه"
    },
    {
        "name": "خاک سفید"
    },
    {
        "name": "تهرانپارس شرقی"
    },
    {
        "name": "قاسم آباد و ده نارمک"
    },
    {
        "name": "اوقاف"
    },
    {
        "name": "شمیران نو"
    },
    {
        "name": "حکیمیه"
    },
    {
        "name": "قنات کوثر"
    },
    {
        "name": "کوهسار"
    },
    {
        "name": "مجید آباد"
    },
    {
        "name": "اتوبان بابایی"
    },
    {
        "name": "اتوبان باقری"
    },
    {
        "name": "اتوبان صیاد شیرازی"
    },
    {
        "name": "بنی هاشم"
    },
    {
        "name": "پلیس"
    },
    {
        "name": "دلاوران"
    },
    {
        "name": "رسالت"
    },
    {
        "name": "سراج"
    },
    {
        "name": "شمس آباد"
    },
    {
        "name": "شهدا"
    },
    {
        "name": "صیاد شیرازی"
    },
    {
        "name": "علم وصنعت"
    },
    {
        "name": "فرجام"
    },
    {
        "name": "لویزان"
    },
    {
        "name": "میدان ملت"
    },
    {
        "name": "هروی"
    },
    {
        "name": "هنگام"
    },
    {
        "name": "شهران جنوبی"
    },
    {
        "name": "شهران شمالی"
    },
    {
        "name": "شهرزیبا"
    },
    {
        "name": "اندیشه"
    },
    {
        "name": "بهاران"
    },
    {
        "name": "کن"
    },
    {
        "name": "المهدی"
    },
    {
        "name": "باغ فیض"
    },
    {
        "name": "پونک جنوبی"
    },
    {
        "name": "پونک شمالی"
    },
    {
        "name": "حصارک"
    },
    {
        "name": "شهرک نفت"
    },
    {
        "name": "کوهسار"
    },
    {
        "name": "مرادآباد"
    },
    {
        "name": "پرواز"
    },
    {
        "name": "سازمان برنامه جنوبی"
    },
    {
        "name": "سازمان برنامه شمالی"
    },
    {
        "name": "ارم"
    },
    {
        "name": "سازمان آب"
    },
    {
        "name": "اباذر"
    },
    {
        "name": "فردوس"
    },
    {
        "name": "مهران"
    },
    {
        "name": "اکباتان"
    },
    {
        "name": "بیمه"
    },
    {
        "name": "آپادانا"
    },
    {
        "name": "جنت آباد جنوبی"
    },
    {
        "name": "جنت آباد شمالی"
    },
    {
        "name": "جنت آباد مرکزی"
    },
    {
        "name": "شاهین"
    },
    {
        "name": "آیت الله کاشانی"
    },
    {
        "name": "اشرفی اصفهانی"
    },
    {
        "name": "ایران زمین شمالی"
    },
    {
        "name": "بلوار تعاون"
    },
    {
        "name": "بلوار فردوس"
    },
    {
        "name": "بولیوار"
    },
    {
        "name": "پونک"
    },
    {
        "name": "پیامبر"
    },
    {
        "name": "جنت آباد"
    },
    {
        "name": "سازمان برنامه"
    },
    {
        "name": "ستاری"
    },
    {
        "name": "سردار جنگل"
    },
    {
        "name": "سولقان"
    },
    {
        "name": "شهر زیبا"
    },
    {
        "name": "شهران"
    },
    {
        "name": "شهرک اکباتان"
    },
    {
        "name": "شهید مهدی باکری"
    },
    {
        "name": "نجات اللهی"
    },
    {
        "name": "ایرانشهر"
    },
    {
        "name": "پارک لاله"
    },
    {
        "name": "کشاورز غربی"
    },
    {
        "name": "نصرت"
    },
    {
        "name": "۱۶آذر"
    },
    {
        "name": "سنایی"
    },
    {
        "name": "بهجت آباد"
    },
    {
        "name": "عباس آباد"
    },
    {
        "name": "قزل قلعه"
    },
    {
        "name": "سیندخت"
    },
    {
        "name": "گلها"
    },
    {
        "name": "شیراز جنوبی"
    },
    {
        "name": "گاندی"
    },
    {
        "name": "ساعی"
    },
    {
        "name": "یوسف آباد"
    },
    {
        "name": "جهاد"
    },
    {
        "name": "جنت"
    },
    {
        "name": "آرژانتین"
    },
    {
        "name": "اتوبان همت"
    },
    {
        "name": "اسکندری"
    },
    {
        "name": "امیر آباد"
    },
    {
        "name": "بلوار کشاورز"
    },
    {
        "name": "توانیر"
    },
    {
        "name": "جمال زاده"
    },
    {
        "name": "حافظ"
    },
    {
        "name": "زرتشت"
    },
    {
        "name": "طالقانی"
    },
    {
        "name": "فاطمی"
    },
    {
        "name": "فلسطین"
    },
    {
        "name": "میدان انقلاب اسلامی"
    },
    {
        "name": "میدان ولیعصر"
    },
    {
        "name": "وزراء"
    },
    {
        "name": "کارگر شمالی"
    },
    {
        "name": "کردستان"
    },
    {
        "name": "کریم خان"
    },
    {
        "name": "شارق الف"
    },
    {
        "name": "دهقان"
    },
    {
        "name": "شارق ب"
    },
    {
        "name": "گرگان"
    },
    {
        "name": "نظام آباد"
    },
    {
        "name": "خواجه نصیر و حقوقی"
    },
    {
        "name": "خواجه نظام شرقی"
    },
    {
        "name": "خواجه نظام غربی"
    },
    {
        "name": "کاج"
    },
    {
        "name": "امجدیه خاقانی"
    },
    {
        "name": "بهار"
    },
    {
        "name": "سهروردی باغ صبا"
    },
    {
        "name": "شهیدقندی- نیلوفر"
    },
    {
        "name": "عباس آباد- اندیشه"
    },
    {
        "name": "حشمتیه"
    },
    {
        "name": "دبستان"
    },
    {
        "name": "ارامنه الف"
    },
    {
        "name": "ارامنه ب"
    },
    {
        "name": "قصر"
    },
    {
        "name": "آپادانا"
    },
    {
        "name": "امام حسین"
    },
    {
        "name": "انقلاب"
    },
    {
        "name": "خواجه نظام"
    },
    {
        "name": "سرباز"
    },
    {
        "name": "سهروردی"
    },
    {
        "name": "شریعتی"
    },
    {
        "name": "شهید مدنی"
    },
    {
        "name": "شیخ صفی"
    },
    {
        "name": "عباس آباد"
    },
    {
        "name": "مدنی"
    },
    {
        "name": "مرودشت"
    },
    {
        "name": "مطهری"
    },
    {
        "name": "مفتح جنوبی"
    },
    {
        "name": "هفت تیر"
    },
    {
        "name": "تهرانپارس"
    },
    {
        "name": "دردشت"
    },
    {
        "name": "مدائن"
    },
    {
        "name": "هفت حوض"
    },
    {
        "name": "فدک"
    },
    {
        "name": "زرکش"
    },
    {
        "name": "نارمک"
    },
    {
        "name": "مجیدیه"
    },
    {
        "name": "کرمان"
    },
    {
        "name": "لشگر شرقی"
    },
    {
        "name": "لشگر غربی"
    },
    {
        "name": "وحیدیه"
    },
    {
        "name": "تسلیحات"
    },
    {
        "name": "جشنواره"
    },
    {
        "name": "سبلان"
    },
    {
        "name": "استادمعین"
    },
    {
        "name": "دکتر هوشیار"
    },
    {
        "name": "شهید دستغیب"
    },
    {
        "name": "فتح"
    },
    {
        "name": "امامزاده عبداله"
    },
    {
        "name": "شمشیری"
    },
    {
        "name": "سرآسیاب مهرآباد"
    },
    {
        "name": "مهرآبادجنوبی"
    },
    {
        "name": "استاد معین"
    },
    {
        "name": "سی متری جی"
    },
    {
        "name": "طوس"
    },
    {
        "name": "مهر آباد جنوبی"
    },
    {
        "name": "مهرآباد"
    },
    {
        "name": "امامزاده عبدالله"
    },
    {
        "name": "فتح – صنعتی"
    },
    {
        "name": "بریانک"
    },
    {
        "name": "سلیمانی تیموری"
    },
    {
        "name": "شبیری جی"
    },
    {
        "name": "هفت چنار"
    },
    {
        "name": "سلسبیل جنوبی"
    },
    {
        "name": "کارون جنوبی"
    },
    {
        "name": "هاشمی"
    },
    {
        "name": "زنجان جنوبی"
    },
    {
        "name": "سلسبیل شمالی"
    },
    {
        "name": "کارون شمالی"
    },
    {
        "name": "آذربایجان"
    },
    {
        "name": "آزادی"
    },
    {
        "name": "امام خمینی"
    },
    {
        "name": "جیحون"
    },
    {
        "name": "حسام الدین"
    },
    {
        "name": "خوش"
    },
    {
        "name": "دامپزشکی"
    },
    {
        "name": "رودکی"
    },
    {
        "name": "سینا"
    },
    {
        "name": "قصرالدشت"
    },
    {
        "name": "مالک اشتر"
    },
    {
        "name": "نواب"
    },
    {
        "name": "کارون"
    },
    {
        "name": "کمیل"
    },
    {
        "name": "شیخ هادی"
    },
    {
        "name": "انقلاب"
    },
    {
        "name": "امیریه ( فرهنگ )"
    },
    {
        "name": "فروزش"
    },
    {
        "name": "قلمستان"
    },
    {
        "name": "منیریه"
    },
    {
        "name": "حشمت الدوله – جمالزاده"
    },
    {
        "name": "اسکندری"
    },
    {
        "name": "دخانیات"
    },
    {
        "name": "مخصوص"
    },
    {
        "name": "جمهوری"
    },
    {
        "name": "حر"
    },
    {
        "name": "انبار نفت"
    },
    {
        "name": "آگاهی"
    },
    {
        "name": "راه آهن"
    },
    {
        "name": "عباسی"
    },
    {
        "name": "هلال احمر"
    },
    {
        "name": "ابوسعید"
    },
    {
        "name": "اسکندری جنوبی"
    },
    {
        "name": "پاستور"
    },
    {
        "name": "حسن آباد"
    },
    {
        "name": "گمرک"
    },
    {
        "name": "وحدت اسلامی"
    },
    {
        "name": "ولیعصر"
    },
    {
        "name": "کارگر جنوبی"
    },
    {
        "name": "کاشان"
    },
    {
        "name": "بهارستان"
    },
    {
        "name": "فردوسی"
    },
    {
        "name": "امامزاده یحیی"
    },
    {
        "name": "پامنار"
    },
    {
        "name": "بازار"
    },
    {
        "name": "سنگلج"
    },
    {
        "name": "تختی"
    },
    {
        "name": "هرندی"
    },
    {
        "name": "آبشار"
    },
    {
        "name": "قیام"
    },
    {
        "name": "کوثر"
    },
    {
        "name": "ایران"
    },
    {
        "name": "دروازه شمیران"
    },
    {
        "name": "امین حضور"
    },
    {
        "name": "پانزده خرداد"
    },
    {
        "name": "پیچ شمیران"
    },
    {
        "name": "خراسان"
    },
    {
        "name": "ری"
    },
    {
        "name": "سعدی"
    },
    {
        "name": "لاله زارنو"
    },
    {
        "name": "مولوی"
    },
    {
        "name": "میدان قیام"
    },
    {
        "name": "صفا"
    },
    {
        "name": "شهید اسدی"
    },
    {
        "name": "زاهد گیلانی"
    },
    {
        "name": "اشراقی"
    },
    {
        "name": "دهقان"
    },
    {
        "name": "نیروی هوایی"
    },
    {
        "name": "پیروزی"
    },
    {
        "name": "حافظیه"
    },
    {
        "name": "امامت"
    },
    {
        "name": "شورا"
    },
    {
        "name": "آشتیانی"
    },
    {
        "name": "زینبیه"
    },
    {
        "name": "سرخه حصار"
    },
    {
        "name": "تهران نو"
    },
    {
        "name": "دماوند"
    },
    {
        "name": "نیرو هوایی"
    },
    {
        "name": "شکوفه"
    },
    {
        "name": "چهارصد دستگاه"
    },
    {
        "name": "جابری"
    },
    {
        "name": "دژکام"
    },
    {
        "name": "شاهین"
    },
    {
        "name": "مینای شمالی"
    },
    {
        "name": "نیکنام"
    },
    {
        "name": "آهنگران"
    },
    {
        "name": "بروجردی"
    },
    {
        "name": "صد دستگاه"
    },
    {
        "name": "فرزانه"
    },
    {
        "name": "سر آسیب دولاب"
    },
    {
        "name": "شیوا"
    },
    {
        "name": "نبی اکرم (ص)"
    },
    {
        "name": "شهرابی ( قیام )"
    },
    {
        "name": "شکیب"
    },
    {
        "name": "پرستار"
    },
    {
        "name": "سیزده آبان"
    },
    {
        "name": "ابوذر"
    },
    {
        "name": "تاکسیرانی"
    },
    {
        "name": "مینای جنوبی"
    },
    {
        "name": "دولاب"
    },
    {
        "name": "خاوران"
    },
    {
        "name": "آهنگ شرقی"
    },
    {
        "name": "آهنگ"
    },
    {
        "name": "قصر فیروزه"
    },
    {
        "name": "اتوبان محلاتی"
    },
    {
        "name": "افراسیابی شمالی"
    },
    {
        "name": "اندرزگو"
    },
    {
        "name": "پاسدارگمنام"
    },
    {
        "name": "شهید محلاتی"
    },
    {
        "name": "فلاح"
    },
    {
        "name": "نبرد"
    },
    {
        "name": "هفده شهریور"
    },
    {
        "name": "مظاهری"
    },
    {
        "name": "مینابی"
    },
    {
        "name": "بیسیم"
    },
    {
        "name": "شوش"
    },
    {
        "name": "طیب"
    },
    {
        "name": "مطهری"
    },
    {
        "name": "ابوذر"
    },
    {
        "name": "هاشم آباد"
    },
    {
        "name": "اتابک"
    },
    {
        "name": "شهید بروجردی"
    },
    {
        "name": "کیانشهر شمالی"
    },
    {
        "name": "کیانشهر جنوبی"
    },
    {
        "name": "رضویه"
    },
    {
        "name": "مشیریه"
    },
    {
        "name": "افسریه شمالی"
    },
    {
        "name": "افسریه جنوبی"
    },
    {
        "name": "مسعودیه"
    },
    {
        "name": "والفجر"
    },
    {
        "name": "قیامدشت"
    },
    {
        "name": "خاورشهر"
    },
    {
        "name": "آهنگ"
    },
    {
        "name": "اتوبان بعثت"
    },
    {
        "name": "افسریه"
    },
    {
        "name": "خاوران"
    },
    {
        "name": "مشیریه"
    },
    {
        "name": "جوادیه"
    },
    {
        "name": "نازی آباد"
    },
    {
        "name": "خزانه"
    },
    {
        "name": "شهرک بعثت"
    },
    {
        "name": "علی آباد شمالی"
    },
    {
        "name": "یاخچی آباد و چهارصد دستگاه"
    },
    {
        "name": "تختی"
    },
    {
        "name": "علی آباد جنوبی"
    },
    {
        "name": "باغ آذری"
    },
    {
        "name": "راه آهن"
    },
    {
        "name": "رجایی"
    },
    {
        "name": "هلال احمر"
    },
    {
        "name": "یاخچی آباد"
    },
    {
        "name": "ابوذر غربی"
    },
    {
        "name": "آذری"
    },
    {
        "name": "امامزاده حسن(ع)"
    },
    {
        "name": "یافت آباد"
    },
    {
        "name": "جلیلی"
    },
    {
        "name": "زهتابی"
    },
    {
        "name": "زمزم"
    },
    {
        "name": "سجاد"
    },
    {
        "name": "گلچین"
    },
    {
        "name": "وصفنارد"
    },
    {
        "name": "ابوذر شرقی"
    },
    {
        "name": "باغ خزانه"
    },
    {
        "name": "بلورسازی"
    },
    {
        "name": "مقدم"
    },
    {
        "name": "ابوذر"
    },
    {
        "name": "امام زاده حسن"
    },
    {
        "name": "قزوین"
    },
    {
        "name": "قلعه مرغی"
    },
    {
        "name": "میدان بهاران"
    },
    {
        "name": "فردوس"
    },
    {
        "name": "تولیدارو"
    },
    {
        "name": "بهداشت"
    },
    {
        "name": "ولیعصر شمالی"
    },
    {
        "name": "رجائی"
    },
    {
        "name": "ولیعصر جنوبی"
    },
    {
        "name": "صادقیه"
    },
    {
        "name": "صاحب الزمان"
    },
    {
        "name": "یافت آباد جنوبی"
    },
    {
        "name": "یافت آباد شمالی"
    },
    {
        "name": "شاد آباد"
    },
    {
        "name": "هفده شهریور"
    },
    {
        "name": "امام خمینی (ره )"
    },
    {
        "name": "شمس آباد"
    },
    {
        "name": "خلیج فارس شمالی"
    },
    {
        "name": "خلیج فارس جنوبی"
    },
    {
        "name": "اتوبان آزادگان"
    },
    {
        "name": "خلیج فارس"
    },
    {
        "name": "سعید آباد"
    },
    {
        "name": "شهرک صاحب الزمان"
    },
    {
        "name": "شهرک ولیعصر"
    },
    {
        "name": "خانی آباد نو شمالی"
    },
    {
        "name": "اسفندیاری و بستان"
    },
    {
        "name": "بهمنیار"
    },
    {
        "name": "خانی آباد نو جنوبی"
    },
    {
        "name": "شریعتی جنوبی"
    },
    {
        "name": "شریعتی شمالی"
    },
    {
        "name": "شکوفه جنوبی"
    },
    {
        "name": "شکوفه شمالی"
    },
    {
        "name": "نعمت آباد"
    },
    {
        "name": "دولت خواه"
    },
    {
        "name": "اسماعیل آباد"
    },
    {
        "name": "شهید کاظمی"
    },
    {
        "name": "رسالت"
    },
    {
        "name": "خانی آباد نو"
    },
    {
        "name": "عبدل آباد"
    },
    {
        "name": "اقدسیه"
    },
    {
        "name": "صفائیه"
    },
    {
        "name": "ظهیر آباد"
    },
    {
        "name": "غیوری"
    },
    {
        "name": "جوانمرد"
    },
    {
        "name": "حمزه آباد"
    },
    {
        "name": "دیلمان"
    },
    {
        "name": "فیروزآبادی"
    },
    {
        "name": "منصوریه"
    },
    {
        "name": "۱۳آبان"
    },
    {
        "name": "دولت اباد"
    },
    {
        "name": "شهادت"
    },
    {
        "name": "استخر"
    },
    {
        "name": "بهشتی"
    },
    {
        "name": "سرتخت"
    },
    {
        "name": "علائین"
    },
    {
        "name": "نفر آباد"
    },
    {
        "name": "ولی آباد"
    },
    {
        "name": "امین آباد"
    },
    {
        "name": "تقی آباد"
    },
    {
        "name": "نظامی"
    },
    {
        "name": "عباس آباد"
    },
    {
        "name": "کهریزک"
    },
    {
        "name": "شهرک دریا"
    },
    {
        "name": "تهرانسر غربی"
    },
    {
        "name": "تهرانسر شرقی"
    },
    {
        "name": "باشگاه نفت"
    },
    {
        "name": "تهرانسر مرکزی"
    },
    {
        "name": "شهرک پاسداران"
    },
    {
        "name": "تهرانسر شمالی"
    },
    {
        "name": "شهرک آزادی"
    },
    {
        "name": "شهرک فرهنگیان"
    },
    {
        "name": "شهرک استقلال"
    },
    {
        "name": "شهرک دانشگاه"
    },
    {
        "name": "چیتگر شمالی"
    },
    {
        "name": "چیتگر جنوبی (شهرک ۲۲ بهمن)"
    },
    {
        "name": "ویلا شهر"
    },
    {
        "name": "وردآورد"
    },
    {
        "name": "شهرک غزالی"
    },
    {
        "name": "شهرک شهرداری"
    },
    {
        "name": "اتوبان تهران کرج"
    },
    {
        "name": "بزرگراه فتح"
    },
    {
        "name": "تهرانسر"
    },
    {
        "name": "شهرک ۲۲بهمن"
    },
    {
        "name": "شهرک دانشگاه شریف"
    },
    {
        "name": "دهکده المپیک"
    },
    {
        "name": "زیبا دشت بالا"
    },
    {
        "name": "گلستان شرقی"
    },
    {
        "name": "زیبادشت پائین"
    },
    {
        "name": "شریف"
    },
    {
        "name": "گلستان غربی"
    },
    {
        "name": "امید – دژبان"
    },
    {
        "name": "شهید باقری"
    },
    {
        "name": "آزادشهر"
    },
    {
        "name": "پیکان شهر"
    },
    {
        "name": "دریاچه چیتگر"
    },
    {
        "name": "شهرک راه آهن – شهرک گلستان"
    }
];

interface Req {
    query?: string;
}

export default function handler(req, res) {

    console.log(req.query)
    let results = [];
    let param = req.query.query;
    for (var i = 0; i < Areas.length; i++) {
        for (let key in Areas[i]) {
            if (Areas[i][key].indexOf(param) != -1) {
                results.push(Areas[i]);
            }
        }
    }

    res.status(200).json(results);
}
